---
kind: type
id: T:Autodesk.Revit.DB.Structure.PointLoadType
source: html/c7b52498-80ca-1da6-bba4-d13744847e5d.htm
---
# Autodesk.Revit.DB.Structure.PointLoadType

PointLoadType class

## Syntax (C#)
```csharp
public class PointLoadType : LoadTypeBase
```